workshops/debuggingAndPerformanceAnalysis/README.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title>Debugging &amp; Performance Analysis</title>
<meta name="author" content="(Compro Prasad)"/>
<link rel="stylesheet" href="../../reveal.js/css/reveal.css"/>

<link rel="stylesheet" href="../../reveal.js/css/theme/black.css" id="theme"/>

<link rel="stylesheet" href="../custom.css"/>

<!-- If the query includes 'print-pdf', include the PDF print sheet -->
</head>
<body>
<div class="reveal">
<div class="slides">
<section id="sec-title-slide"><h1 class="title">Debugging &amp; Performance Analysis</h1>
</section>

<section>
<section id="slide-orgae4682b">
<h2 id="orgae4682b">What is debugging?</h2>
<p class="fragment (appear)">
Debugging is the process of resolving defects in a computer program.
</p>
</section>
</section>
<section>
<section id="slide-orgdd4122a">
<h2 id="orgdd4122a">Why debugging?</h2>
<p class="fragment (appear)">
We make mistakes while writing code. So, there should be a tool to make it easy
to resolve the defects in the program.
</p>
</section>
</section>
<section>
<section id="slide-org75c7eb5">
<h2 id="org75c7eb5">Types of debugging</h2>
<ul>
<li class="fragment appear">Print debugging</li>
<li class="fragment appear">Postmortem debugging</li>
<li class="fragment appear">Unit testing</li>
<li class="fragment appear">Rubber duck debugging</li>
<li class="fragment appear">Interactive debugging</li>

</ul>
</section>
</section>
<section>
<section id="slide-org575d851">
<h2 id="org575d851">Print debugging</h2>
<p>
Print statements are added to the code to check:
</p>
<ul>
<li class="fragment appear">Values of variables</li>
<li class="fragment appear">Piece of code is being executed or not</li>

</ul>
</section>
</section>
<section>
<section id="slide-orgfa427cf">
<h2 id="orgfa427cf">Postmortem debugging</h2>
<p>
In this type the memory dump generated after a program crash is analyzed using
some tools.
</p>
</section>
</section>
<section>
<section id="slide-orged62d99">
<h2 id="orged62d99">Unit Testing</h2>
<p>
Writing tests for all possible outcomes eliminates the need for manual
debugging. If the tests have 100% coverage of the source code doesn’t mean that
all outcomes have been tested. That is why this too is not a complete solution
for debugging code.
</p>
</section>
</section>
<section>
<section id="slide-org3cf5fc0">
<h2 id="org3cf5fc0">Rubber Duck Debugging</h2>
<p>
A programmer carries a duck around with him to explain the code to an inanimate
object line-by-line thus forcing him to understand what the code does. This is
an unreliable technique and should be avoided.
</p>
</section>
</section>
<section>
<section id="slide-orgdd3b6ec">
<h2 id="orgdd3b6ec">Interactive debugging</h2>
<p>
In this the programmer has a tool to analyze the code while it is running line
by line.
</p>

<p>
This will be the main topic of discussion using a tool named <code>GDB</code>.
</p>
</section>
</section>
<section>
<section id="slide-org3200447">
<h2 id="org3200447">GNU Debugger</h2>
<div class="outline-text-2" id="text-org3200447">
</div>
</section>
<section id="slide-org585efa1">
<h3 id="org585efa1">Basic tasks</h3>
<ul>
<li class="fragment appear">Breakpoints</li>
<li class="fragment appear">Stepping through code</li>
<li class="fragment appear">Getting stack trace</li>
<li class="fragment appear">Print variable values</li>

</ul>
</section>
<section id="slide-orgb410716">
<h3 id="orgb410716">Breakpoints</h3>
<p>
Setting breakpoints stops the execution of the program in the debugger so that
we can check what is happening and can further control the execution of the
program.
</p>
</section>
<section id="slide-orge865bce">
<h3 id="orge865bce">Setting breakpoints</h3>
<p>
Setting a breakpoint in a program can be done using:
</p>
<ul>
<li class="fragment appear">Function name: <code>b main</code></li>
<li class="fragment appear">Line number: <code>b 23</code></li>
<li class="fragment appear">Conditional: <code>b 23 if x == 2</code></li>

</ul>
</section>
<section id="slide-org8d9a02b">
<h3 id="org8d9a02b">Listing breakpoints</h3>
<p>
You can see all the breakpoints in the program using
</p>
<div class="org-src-container">

<pre  class="src src-sh">info breakpoints
</pre>
</div>
</section>
<section id="slide-org9aba368">
<h3 id="org9aba368">Deleting breakpoints</h3>
<p>
You can delete a breakpoint using the <b><b>number</b></b> from the <code>info</code>:
</p>
<div class="org-src-container">

<pre  class="src src-sh">delete 3
</pre>
</div>
</section>
<section id="slide-org956ca73">
<h3 id="org956ca73">Watchpoints</h3>
<p>
Keep track of a variable and break whenever its value changes.
</p>
<div class="org-src-container">

<pre  class="src src-sh">watch var_name
</pre>
</div>
</section>
<section id="slide-orgbc64fff">
<h3 id="orgbc64fff">Stepping through code</h3>
<ul>
<li class="fragment appear"><code>next</code> - Execute current line and jump to the next one</li>
<li class="fragment appear"><code>step</code> - Execute current line and jump to the function definition</li>
<li class="fragment appear"><code>run</code> - Execute the code from the <code>main</code> function</li>
<li class="fragment appear"><code>continue</code> - Continue executing code until it reaches a breakpoint</li>
<li class="fragment appear"><code>finish</code> - Complete the current function call and get out of it</li>

</ul>
</section>
<section id="slide-org4b408f5">
<h3 id="org4b408f5">Printing variables</h3>
<ul>
<li class="fragment appear"><code>print expression</code> - print an expression’s value</li>
<li class="fragment appear"><code>display expression</code> - print an expression’s value as the program stops</li>

</ul>
</section>
<section id="slide-org19b522e">
<h3 id="org19b522e">Compiling</h3>
<p>
To be able to debug a C++ program in <code>gdb</code> one has to compile it using the
<code>-ggdb</code> argument to <code>gcc</code>.
</p>
<div class="org-src-container">

<pre  class="src src-sh">gcc -ggdb -o program program.cpp
</pre>
</div>
</section>
<section id="slide-orgee00198">
<h3 id="orgee00198">Launching <code>gdb</code></h3>
<div class="org-src-container">

<pre  class="src src-sh">gdb ./program
</pre>
</div>
</section>
</section>
<section>
<section id="slide-org9411f8b">
<h2 id="org9411f8b">Hardware vs Software Breakpoints</h2>
</section>
</section>
<section>
<section id="slide-org5d3ee24">
<h2 id="org5d3ee24">Performance Analysis</h2>
</section>
</section>
<section>
<section id="slide-orgf456846">
<h2 id="orgf456846">Thank you</h2>
</section>
</section>
</div>
</div>
<script src="../../reveal.js/lib/js/head.min.js"></script>
<script src="../../reveal.js/js/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({

controls: true,
progress: true,
history: false,
center: true,
slideNumber: 'c',
rollingLinks: false,
keyboard: true,
overview: true,

theme: Reveal.getQueryHash().theme, // available themes are in /css/theme
transition: Reveal.getQueryHash().transition || 'slide', // default/cube/page/concave/zoom/linear/fade/none
transitionSpeed: 'default',
multiplex: {
    secret: '', // null if client
    id: '', // id, obtained from socket.io server
    url: '' // Location of socket.io server
},

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: '../../reveal.js/lib/js/classList.js', condition: function() { return !document.body.classList; } },
 { src: '../../reveal.js/plugin/markdown/marked.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: '../../reveal.js/plugin/markdown/markdown.js', condition: function() { return !!document.querySelector( '[data-markdown]' ); } },
 { src: '../../reveal.js/plugin/zoom-js/zoom.js', async: true, condition: function() { return !!document.body.classList; } },
 { src: '../../reveal.js/plugin/notes/notes.js', async: true, condition: function() { return !!document.body.classList; } }]
});
</script>
</body>
</html>
